{"_id":{"$oid":"62658e570143093006b299ed"},"char_name":"Ragnar","char_desc":"Ragnar Lothbrok is a restless warrior and family man who longs to find and explore new countries across the sea. His goal is to settle his own people to thrive on rich new farm lands. Now that he is King, his ambition to raid new kingdoms remains unquenchable, not least because he claims to be an ancestor of the Norse god Odin–the god of slain warriors, but also the god of eternal curiosity.","type":"is_character","comment":"Was played by Travis Fimmel","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299ee"},"char_name":"Travis Fimmel","char_desc":null,"type":"is_actor","comment":"Played Ragnar","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299ef"},"char_name":"Lagertha","char_desc":"Lagertha is the first wife of Ragnar Lothbrok. She is an Earl, a strong shield-maiden and a force to be reckoned with. She has always fought in the shield-wall alongside the men. Although fate has pulled her apart from Ragnar, it seems that the gods must have a plan to bring them back together, where they belong.","type":"is_character","comment":"Was played by Katheryn Winnick","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299f0"},"char_name":"Katheryn Winnick","char_desc":null,"type":"is_actor","comment":"Played Lagertha","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299f1"},"char_name":"Aethelwulf","char_desc":"Son of King Ecbert, Aethelwulf doesn’t understand his father’s interest in Ragnar and the pagan Northmen, but as a faithful son he will do whatever his father asks. Ecbert is grooming him to become king and continue his lineage.","type":"is_character","comment":"Was played by Moe Dunford","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299f2"},"char_name":"Moe Dunford","char_desc":null,"type":"is_actor","comment":"Played Aethelwulf","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299f3"},"char_name":"Astrid","char_desc":"Astrid is a beautiful young woman who has joined Lagertha’s court at Hedeby. She is a free spirit who refuses to accept social conventions or recognize any barriers to her freedom: she is on a voyage of self-discovery. Lagertha will train Astrid in the arts of war, and the arts of love.","type":"is_character","comment":"Was played by Josefin Asplund","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299f4"},"char_name":"Josefin Asplund","char_desc":null,"type":"is_actor","comment":"Played Astrid","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299f5"},"char_name":"Bjorn","char_desc":"Bjorn Lothbrok is the son of Ragnar and Lagertha and the oldest of Ragnar’s many sons. Intelligent and determined, Bjorn loves and admires his father above all men. Following in Ragnar’s footsteps, Bjorn desires to test himself as a fighter as well as an explorer. After fighting in battle without receiving one wound or scratch, he garnered the famous nickname “Bjorn Ironside.”","type":"is_character","comment":"Was played by Alexander Ludwig","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299f6"},"char_name":"Alexander Ludwig","char_desc":null,"type":"is_actor","comment":"Played Bjorn","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299f7"},"char_name":"Emperor Charles","char_desc":"Emperor Charles is a complex, troubled man, who has taken full credit for the defeat of the Vikings, although he hid in cowardice during the battle.","type":"is_character","comment":"Was played by Lothaire Bluteau","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299f8"},"char_name":"Lothaire Bluteau","char_desc":null,"type":"is_actor","comment":"Played Emperor Charles","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299f9"},"char_name":"Floki","char_desc":"Floki is a genius ship builder and he designs and builds the prototype of the new generation of Viking ships which can sail across the open ocean but also up the shallowest of rivers. Without Floki, Ragnar would have never been able to fulfill his dreams of discovering new lands and new civilizations. Floki is a religious zealot who believes in the Gods above anything and everything, including Ragnar.","type":"is_character","comment":"Was played by Gustaf Skarsgård","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299fa"},"char_name":"Gustaf Skarsgård","char_desc":null,"type":"is_actor","comment":"Played Floki","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299fb"},"char_name":"Halfdan the Black","char_desc":"King Harald’s violent, devoutly loyal younger brother.","type":"is_character","comment":"Was played by Jasper Pääkkönen","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299fc"},"char_name":"Jasper Pääkkönen","char_desc":null,"type":"is_actor","comment":"Played Halfdan the Black","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299fd"},"char_name":"Hvitserk","char_desc":"Son of Ragnar. Hvitserk and his older brother Ubbe have a special bond because when they were children they jumped together in an icy lake and had to be rescued by Siggy, who died in the attempt. Hvitserk is more complex and a darker character than his brother Ubbe, characteristics which become more pronounced in time and lead to a terrible denouement.","type":"is_character","comment":"Was played by Marco Ilsø","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299fe"},"char_name":"Marco Ilsø","char_desc":null,"type":"is_actor","comment":"Played Hvitserk","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b299ff"},"char_name":"Ivar the Boneless","char_desc":"Son of Ragnar. Perhaps the most famous Viking of all time, his pathological cruelty was notorious even during his own lifetime. Ivar is deeply ambitious and his ambitions will twist the legacy of his father out of shape, and create universal war. People are genuinely afraid of Ivar.","type":"is_character","comment":"Was played by Alex Høgh Andersen","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a00"},"char_name":"Alex Høgh Andersen","char_desc":null,"type":"is_actor","comment":"Played Ivar the Boneless","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a01"},"char_name":"Judith","char_desc":"Judith is the daughter of King Aelle and wife to Aethelwulf. Her infatuation with Athelstan became her downfall, and their affair led to the birth of the child Alfred, who King Ecbert believes to be a child of God. Judith and her son survived through the protection of King Ecbert, but his protection comes with a price.","type":"is_character","comment":"Was played by Jennie Jacques","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a02"},"char_name":"Jennie Jacques","char_desc":null,"type":"is_actor","comment":"Played Judith","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a03"},"char_name":"King Ecbert","char_desc":"King Ecbert is the ruler of Wessex, the largest of the five kingdoms in England with big plans to make it even larger. Ecbert is a sophisticated visionary, well versed in court life. Ecbert has always anticipated that he must someday face the Vikings and is prepared with strategies as to how they can be used to his advantage.","type":"is_character","comment":"Was played by Linus Roache","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a04"},"char_name":"Linus Roache","char_desc":null,"type":"is_actor","comment":"Played King Ecbert","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a05"},"char_name":"King Harald Finehair","char_desc":"A complex character who seeks to be King of Norway and is a potential threat to Ragnar.","type":"is_character","comment":"Was played by Peter Franzén","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a06"},"char_name":"Peter Franzén","char_desc":null,"type":"is_actor","comment":"Played King Harald Finehair","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a07"},"char_name":"Princess Gisla","char_desc":"The daughter of Emperor Charles and a beautiful, young woman of considerable courage and resolution. However, she is still a woman and therefore remains at the mercy of the powerful and calculating men around her. Much to her dismay, she is forced into an arranged marriage with Rollo, the new Duke of Normandy.","type":"is_character","comment":"Was played by Morgane Polanski","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a08"},"char_name":"Morgane Polanski","char_desc":null,"type":"is_actor","comment":"Played Princess Gisla","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a09"},"char_name":"Queen Aslaug","char_desc":"Aslaug is the clever and beautiful daughter of the famed dragon slayer Sigurd and shield-maiden Brunhilde. Aslaug promised Ragnar that she would provide him with the sons which the ancient Seer prophesized for him–and she delivered.","type":"is_character","comment":"Was played by Alyssa Sutherland","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a0a"},"char_name":"Alyssa Sutherland","char_desc":null,"type":"is_actor","comment":"Played Queen Aslaug","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a0b"},"char_name":"Rollo","char_desc":"Rollo, Ragnar’s brother, is impulsive, wild, care-free and compulsive. Rollo is a fierce fighter who is often overshadowed by his brother. The relationship between Rollo and Ragnar is intense and always unpredictable. Rollo has become the Duke of Normandy after marrying Princess Gisla (the daughter of Emperor Charles) and is named defender of France from the Vikings.","type":"is_character","comment":"Was played by Clive Standen","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a0c"},"char_name":"Clive Standen","char_desc":null,"type":"is_actor","comment":"Played Rollo","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a0d"},"char_name":"Sigurd Snake in the Eye","char_desc":"Son of Ragnar. Sigurd was born with astigmatism in one eye, in the shape of a snake or dragon. This flaw has a damaging psychological impact on him, making him feel different from his older brothers and more estranged from the family. He is a sensitive young man, growing up feeling that he has to provide himself.","type":"is_character","comment":"Was played by David Lindström","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a0e"},"char_name":"David Lindström","char_desc":null,"type":"is_actor","comment":"Played Sigurd Snake in the Eye","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a0f"},"char_name":"Ubbe","char_desc":"The oldest son by Ragnar and Aslaug, he has a paternalistic attitude towards his younger brothers. Ubbe is a sensitive, thoughtful and attractive young man, in many ways the closest in outlook and instinct to his father Ragnar.","type":"is_character","comment":"Was played by Jordan Patrick Smith","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a10"},"char_name":"Jordan Patrick Smith","char_desc":null,"type":"is_actor","comment":"Played Ubbe","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a11"},"char_name":"The Seer","char_desc":"The ancient seer is one of the most important figures in Viking life because the Vikings believe in fate and the Seers can read the runes and often translate the wishes of the gods.","type":"is_character","comment":"Was played by John Kavanagh","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a12"},"char_name":"John Kavanagh","char_desc":null,"type":"is_actor","comment":"Played The Seer","source":"vikings_tv"}
{"_id":{"$oid":"62658e570143093006b29a13"},"char_name":"Chieftain Olav","char_desc":"He finds a route to sail west, and is in possession of a much-coveted map","type":"is_character","comment":"Was played by Henrik Mestad","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a14"},"char_name":"Henrik Mestad","char_desc":"Henrik Mestad (born 22 June 1964) is a Norwegian stage, film, and television actor. He received the Hedda Award in 2011.[1]\nMestad was born in Oslo as a son of the politician Viking Mestad.[1] He is educated at the Norwegian Theatre Academy and was hired at Nationaltheatret in 1991. \nAs a dramatist, Mestad penned and starred in the plays Lik meg når jeg er teit (1993) and Nansens sønn (2002), both of which played at Nationaltheatret. On the screen, he has starred in Svarte pantere (1992), Vestavind (TV series, 1994–95), Sons (2006), The Art of Negative Thinking and Tatt av kvinnen (2007). In 2013-2014, he co-starred in seasons two and three of the Netflix original series Lilyhammer. In 2015, he portrayed the Norwegian Prime Minister, Jesper Berg, in the political thriller Occupied.[1][2] He played the Viking Chieftain Olav in seasons one and three of the Netflix original series Norsemen (TV Series) in 2017 and 2020 respectively.[3]\n\nThis article about a Norwegian actor is a stub. You can help Wikipedia by expanding it.","type":"is_actor","comment":"Played Chieftain Olav","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a15"},"char_name":"Hildur","char_desc":"","type":"is_character","comment":"Was played by Marian Saastad Ottesen","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a16"},"char_name":"Marian Saastad Ottesen","char_desc":"\nAstrid Marian Saastad Ottesen (born 24 November 1975) is a Norwegian actress who has been performing in theatre, television, and film since 2001. She is best known to international audiences from the Netflix series Lilyhammer[1] and Norsemen.[2]\nOttesen was born in Florø and grew up in Skien, where she attended theatre school.[citation needed] She graduated from the Norwegian National Academy of Theatre in 1999.[citation needed] Ottesen worked in several productions at Oslo Nye Teater, Centralteatret, as well as the National Theatre in Oslo, until 2006.[citation needed]\nShe has since appeared in a number of television productions and films, including Elsk meg i morgen (2005), Gone with the Woman (2007), Lilyhammer,[3] and Norsemen.[4]\nIn 2018, Ottesen married Norsemen co-star Nils Jørgen Kaalstad.[5]\n","type":"is_actor","comment":"Played Hildur","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a17"},"char_name":"Arvid","char_desc":"He loves to go on raids but he also wants to settle in the village","type":"is_character","comment":"Was played by Nils Jørgen Kaalstad","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a18"},"char_name":"Nils Jørgen Kaalstad","char_desc":"\nNils Jørgen \"Jøgge\" Kaalstad (born 23 January 1979 in Bærum) is a Norwegian actor and musician who performs under the stage name Sideshow Jøgge. He is best known to international audiences as Dag Solstad from Lilyhammer[1] and Arvid from Norsemen,[2] both shown on Netflix.\nNils Jørgen Kaalstad was a child actor in Bærum Children's Theater between the years 1985 and 1997. At the same time, he appeared in various short films, as well as playing the roles of Olaf in Henrik Ibsen's The Pillars of Society and Anton in Det Lykkelige Valg at the National Theatre in 1992 and 1993, respectively.\nHe graduated from the Norwegian National Academy of Theatre in the spring of 2007.\nSince January 2009, he has been permanently employed as an actor at the National Theatre.\nFrom 2012 to 2014, Kaalstad had a recurring role on the Netflix show Lilyhammer about a former New York gangster trying to start a new life in Lillehammer, Norway.\nIn 2016, he landed a major role in the Netflix comedy series Norsemen, a parody of Viking life and customs.[3] He kept the role for the duration of the show's three seasons, until March 2020.\nIn 2019, Kaalstad received the Hedda Award in the category Best Male Actor for his role in the play Uten navn - Å miste sine nærmeste by Mattis Herman Nyquist and Fredrik Høyer.[4]\nKaalstad performs as an electronic musician under the stage name Sideshow Jøgge, often with collaborator Olav Brekke Mathisen. They have made a number of music videos for other artists such as Snuten and King Midas, as well as commercials, including for Quart Festival 2005. The duo released the album N*A*O*M*B (Nugatti All Ova Me Butty) in 2003.[5]\nIn 2018, Kaalstad married actress Marian Saastad Ottesen, who also stars in Lilyhammer and Norsemen.[6]\n","type":"is_actor","comment":"Played Arvid","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a19"},"char_name":"Orm","char_desc":"","type":"is_character","comment":"Was played by Kåre Conradi","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a1a"},"char_name":"Kåre Conradi","char_desc":"Kåre Conradi (born 11 January 1972) is a Norwegian actor.\nConradi was born in Asker and he is a graduate of the Norwegian Theatre Academy and the London Academy of Music and Dramatic Art. He made his stage debut at Oslo Nye Teater in 1989, was employed at the Nationaltheatret from 1995, and also had a stint at Trøndelag Teater. In 2016, he won a Hedda Award for best male actor.[1]\nOn television, Conradi has appeared in Clique, W1A, Heimebane (Home Ground) and Shetland among other roles. He has been starring in Norwegian historical comedy Norsemen since 2016.\n\n\nThis article about a Norwegian actor is a stub. You can help Wikipedia by expanding it.","type":"is_actor","comment":"Played Orm","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a1b"},"char_name":"Frøya","char_desc":"","type":"is_character","comment":"Was played by Silje Torp","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a1c"},"char_name":"Silje Torp","char_desc":"\nSilje Torp (born Silje Torp Færavaag, 19 October 1974 in Oslo) is a Norwegian actress, author, and trainer.\nTorp attended the Norwegian National Academy of Theatre from 1997 until 2000. Before this, she lived in Italy for three years and went to an art academy in Carrara, where she trained to become a sculptor/stonemason.\nShe came to international prominence with her role as the shield-maiden Frøya in the television series Norsemen between 2016 and 2020.[1] The series was first shown on the Norwegian public broadcaster NRK, and later on the streaming platform Netflix. Torp was previously known for her role as sheriff Mette Hansen in season two of the series Lilyhammer.[2]\nTorp works as a personal fitness trainer. \nIn January 2019, she published the book Sterk med strikk (Strong with Elastic) through Cappelen Damm.[3]\n","type":"is_actor","comment":"Played Frøya","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a1d"},"char_name":"Rufus","char_desc":"","type":"is_character","comment":"Was played by Trond Fausa Aurvåg","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a1e"},"char_name":"Trond Fausa Aurvåg","char_desc":"\nTrond Fausa Aurvåg (born 2 December 1972) is a Norwegian actor, film director, and poet.\nAfter graduating from the Norwegian National Academy of Theatre in 2001, he has acted at Oslo Nye Teater since 2001.[2] Here he has acted in plays such as Amadeus, Manndomsprøven and Tatt av kvinnen.[3] As a film actor he is best known for his leading roles in the films Andreaskorset (2004) and Den brysomme mannen (2006).[4] He has also starred in the music video for Lemaitre's song \"We Got U\".[5]\nHe won two Amandas—the main Norwegian film award—in 2006, for best actor for his role in Den brysomme mannen, and for the short film Alene menn sammen, which he directed.[6] He gained some international attention co-starring with Steven Van Zandt in the TV series Lilyhammer, playing Van Zandt's partner in crime. For this role he won the Gullruten Award in 2014 for best actor.[7]\nAurvåg lives with his wife, actress Lena Kristin Ellingsen, in Oslo.[2]\n","type":"is_actor","comment":"Played Rufus","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a1f"},"char_name":"Kark","char_desc":"","type":"is_character","comment":"Was played by Øystein Martinsen","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a20"},"char_name":"Øystein Martinsen","char_desc":"\nØystein Martinsen (born 14 May 1976 in Tromsø) is a Norwegian actor known to international audiences for his role in the Netflix series Norsemen.[1]\nMartinsen enrolled at the Oslo National Academy of the Arts in 2001, and after graduating in 2004, became a permanent employee at Rogaland Theatre in the city of Stavanger. In addition to over forty productions at this and other theatres, Martinsen has also appeared in several films and television series.\nIn 2012, he was nominated for the Hedda Award in the category Best Supporting Actor for his role as Philinte in The Misanthrope at Rogaland Theatre.\nIn 2016, Martinsen was cast in the role of Kark, a freed slave with Stockholm syndrome, in the Netflix series Norsemen,[2] a parody of Viking life and customs.[3] He kept the role for the duration of the show's three seasons, until March 2020.\nHe is the brother of electronic musician Per Martinsen.\n","type":"is_actor","comment":"Played Kark","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a21"},"char_name":"Jarl Varg","char_desc":"","type":"is_character","comment":"Was played by Jon Øigarden","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a22"},"char_name":"Jon Øigarden","char_desc":"Jon Øigarden (born 31 May 1971) is a Norwegian actor, who is well known for his role as journalist Peter Verås in the TV series Mammon, Jarl Varg in Norsemen, and other Norwegian films.\nJon Øigarden was educated at the Norwegian National Academy of Theatre, and has acted both on stage and on screen. Between 1997 and 1999 he worked at Oslo Nye Teater. Among the plays he has acted in is Mirandolina by Carlo Goldoni and an adaptation of Graham Greene's Travels with My Aunt, and he has had roles in such movies as Detektor (2000) and the comedy Get Ready to Be Boyzvoiced (2000). Øigarden has been cast to portray the Norwegian war criminal Henry Rinnan on film; the filming was planned to start some time in 2009.[1] For a while he both ran and acted in the theater Torshovteateret, with his colleagues Mads Ousdal and Trond Espen Seim.[2]\nThis article about a Norwegian actor is a stub. You can help Wikipedia by expanding it.","type":"is_actor","comment":"Played Jarl Varg","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a23"},"char_name":"Liv","char_desc":"","type":"is_character","comment":"Was played by Kristine Riis","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a24"},"char_name":"Kristine Riis","char_desc":"\nKristine Riis (born 3 August 1982) is a Norwegian actress and comedian. She is best known to international audiences for her role in the Netflix series Norsemen.[1]\nTogether with Live Nelvik and Siri Kristiansen, Riis hosted the show Drillpikene on NRK P3 from 2007 until 2009.[2] She was also a guest host on the SNL-like show Torsdag kveld fra Nydalen[3] and played the role of Benedicte in the series Nissene over skog og hei. In 2012, she joined the cast of Løvebakken. She became a permanent member of the series Underholdningsavdelingen on NRK1 in the spring of 2015.\nIn 2016, Riis was cast in the role of Liv, an opportunistic former slave who becomes the soon-to-be chieftain's wife, in the Netflix series Norsemen, a parody of Viking life and customs.[4] She remained in the role for the duration of the show's three seasons, until March 2020.\nFrom 2017 until 2018, Riis hosted the talk show Lørdagsrådet, which had previously been hosted by Siri Kristiansen (2010–17) and is currently presented by Live Nelvik.[5]\nIn 2017, Riis confirmed that she was dating comedian Jon Niklas Rønning.[6] In May 2019, Riis gave birth to their child, a boy whom they have named Charlie Riis Rønning.[7] The relationship ended in the autumn of 2019.[8]\n","type":"is_actor","comment":"Played Liv","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a25"},"char_name":"Torstein Hund","char_desc":"","type":"is_character","comment":"Was played by Bjørn Myrene","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a26"},"char_name":"Bjørn Myrene","char_desc":"Other reasons this message may be displayed:\n","type":"is_actor","comment":"Played Torstein Hund","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a27"},"char_name":"Ragnar","char_desc":"","type":"is_character","comment":"Was played by Mikkel Bratt Silset","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a28"},"char_name":"Mikkel Bratt Silset","char_desc":"\nMikkel Bratt Silset (born 1991) is a Norwegian theatre, television, and film actor from Oslo best known to international audiences for his role in the Netflix series Norsemen.[1]\nSilset began acting as a child and had his first major role at the age of fourteen, in the 2006 feature film Sons. Two years later, he played the role of Georg in Eva Dahr's film adaptation of Jostein Gaarder's novel Appelsinpiken. As a student, he also had roles in the television series Lilyhammer, Dag, and the movie Beatles, based on the novel of the same name.\nSilset studied acting at the Oslo National Academy of the Arts from 2012, graduating in 2015.[2]\nIn 2016, he was cast in the role of Ragnar, the violent but fun-loving right-hand man of the soon-to-be chieftain Arvid, played by Nils Jørgen Kaalstad, in the Netflix series Norsemen,[3] a parody of Viking life and customs.[4] He kept the role for the duration of the show's three seasons, until March 2020.\nIn 2017, Silset played the role of Teo, a bank robber, in the NRK1 thriller-drama series Valkyrien.[5]\nIn 2018, he appeared in two episodes of the dramedy Unge lovende.\nIn 2019, he acted in the HBO series Beforeigners as Nabo, the Stone-Age neighbour of lead protagonist Lars Haaland, played by Nicolai Cleve Broch. He also played a small part in the miniseries Hellums kro the same year.\n","type":"is_actor","comment":"Played Ragnar","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a29"},"char_name":"Ørn","char_desc":"","type":"is_character","comment":"Was played by André Eriksen","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a2a"},"char_name":"André Eriksen","char_desc":"Other reasons this message may be displayed:\n","type":"is_actor","comment":"Played Ørn","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a2b"},"char_name":"Jarl Bjørn","char_desc":"","type":"is_character","comment":"Was played by Thorbjørn Harr","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a2c"},"char_name":"Thorbjørn Harr","char_desc":"Thorbjørn Harr (born 24 May 1974) is a Norwegian actor.\nHarr was discovered in a schoolyard by NRK people who were scouting for actors for youth series.\nHe soon became a familiar face on programs like Blikkbåx and U and also appeared in the popular 1991 television movie Frida – med hjertet i hånden.[1] He later had minor roles in Lille Lørdag in 1995 and a major role in the mini-series Lekestue broadcast on NRK in 2002. His real film debut came in 2003 in  Mot Moskva, where he played the leading role of Vassi and was nominated for an Amanda Award, and in 2005 he appeared in Venner for livet.[1] He played the lead role of Mathias in Mars & Venus (2007). He played Jarl Borg in History's Vikings.[2][3] Beginning in 2000, he has also appeared in several stage productions. With comedian Harald Eia and two others, he runs Teatersport Oslo.[4] More recently, he has had a recurring role in the American comedy-drama TV series Younger, playing the love interest of a character played by Hilary Duff.\nShortly after graduating from the Norwegian National Academy of Theatre in 2000, Harr joined the National Theatre in Oslo. He has appeared there as Håkon Håkonsson in Ibsen's The Pretenders and as the young Speer in the production of the same name.[1] He has played Figaro in Beaumarchais' The Marriage of Figaro, Erhart in John Gabriel Borkman,[1] and Tom in The Glass Menagerie.[4] He has appeared in many productions by Jo Strømgren,[4] including There, which won the 2002 Hedda Award for best play. As of January 2007[update] he had appeared in almost 20 National Theatre productions.\nHarr married Tai Victoria Grung in 2006; they have three children.[8]\n","type":"is_actor","comment":"Played Jarl Bjørn","source":"norsemen_tv"}
{"_id":{"$oid":"62658e570143093006b29a2d"},"char_name":"Jordan Berry","char_desc":"Jordan Berry signs with the Vikings after spending the 2021 season with the club, appearing in all 17 games and accumulating the fourth-most net punting yards (3,225) and finishing eighth in punts inside the 20 (27) in the NFL. The Eastern Kentucky product registered a pair of 60-plus punts in his first game with the Vikings at Cincinnati in Week 1, matching a club record for 60-yard punts in a game. His season-long punt of 64 yards came against the Green Bay Packers in Week 17. Berry averaged 46.5 gross yards per punt in 2021, which is second all-time in franchise history. Prior to his time with the Vikings, he played six seasons for the Pittsburgh Steelers, owning three of the top 10 single-season punting averages in franchise history â 45.8 (fourth, 2020), 45.6 (sixth, 2016), 45.5 (seventh, 2019).","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a2e"},"char_name":"Tuf Borland","char_desc":"â¢ Started 31 of the 49 career games he played at Ohio State, joining only J.T. Barrett in Buckeye history as a 3-time captain.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a2f"},"char_name":"Kris Boyd","char_desc":"â¢ Led Minnesota with 11 special teams tackles in 2019.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a30"},"char_name":"Garrett Bradbury","char_desc":"â¢ Started every game at center as Vikings notched a 3,000-yard passer, 1,000-yard rusher and 1,000-yard receiver in the same season for the 8th time in franchise history in 2020. It's the 1st time the Vikings have done so in back-to-back seasons (2019-20) since 1997-98.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a31"},"char_name":"Blake Brandel","char_desc":"â¢ Spent entire rookie season on Vikings practice squad in 2020.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a32"},"char_name":"Camryn Bynum","char_desc":"â¢ Only Cal player to start all 42 games from 2017-20, all at CB.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a33"},"char_name":"Dan Chisena","char_desc":"â¢ Played in 14 games as a rookie free agent in 2020.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a34"},"char_name":"Ezra Cleveland","char_desc":"â¢ Started 9 games at RG during rookie campaign.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a35"},"char_name":"Ryan Connelly","char_desc":"â¢ Minnesota native who played high school football at perennial power Eden Prairie under head coach Mike Grant, the son of Pro Football Hall of Fame Vikings coach Bud Grant.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a36"},"char_name":"Dalvin Cook","char_desc":"â¢ Earned consecutive Pro Bowl berths in 2019 and 2020.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a37"},"char_name":"Kirk Cousins","char_desc":"â¢ Ranks 2nd in Vikings history with 35 TD passes in a season in 2020, and his 8 games with 3+ passing TDs in 2020 is a Vikings record, passing Daunte Culpepper's 7 in 2000.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a38"},"char_name":"Cameron Dantzler","char_desc":"â¢ Named to PFWA All-Rookie Team, the 1st Vikings CB to have the honor since Dewayne Washington in 1994.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a39"},"char_name":"Christian Darrisaw","char_desc":"â¢ The 7th OT drafted by the Vikings in the 1st round in Vikings history and the 5th-highest at #23.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a3a"},"char_name":"Zach Davidson","char_desc":"â¢ One of best TEs in Division II in 2019 was a consensus 1st-Team All-America, but 2020 season was cancelled due to Covid-19.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a3b"},"char_name":"Jesse Davis","char_desc":"Jesse Davis joins the Vikings after spending the past five years with the Miami Dolphins, earning 72 starts in 80 games played. In 2021, Davis started 14 games at right tackle and two games at left guard for the Dolphins. Known for his versatility, Davis is one of three players in Dolphins history to start games at four different positions (RT, RG, LG, LT), joining Jeff Dellenbach and Nate Garner. Davis is a two-time team captain (2020-21) and was the only player on Miami to play all of the team's offensive snaps (920) in 2018. Prior to joining the Dolphins, Davis spent time on the New York Jets (2016) and Seattle Seahawks (2015) practice squads. The Asotin, Washington, native went undrafted in the 2015 NFL Draft and was a three-year starter at Idaho (2012-14), playing in 39 games with 27 starts, playing on the defensive line from 2010-12 before moving to the offensive side of the ball.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a3c"},"char_name":"Wyatt Davis","char_desc":"â¢ 2020 Big Ten Conference Rimington-Pace Offensive Lineman of the Year, the first G in Ohio State history to win the award.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a3d"},"char_name":"Andrew DePaola","char_desc":"â¢ Took over long-snapping duties for the Vikings in the final 7 games of 2020.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a3e"},"char_name":"Myles Dorn","char_desc":"â¢ Father, Torin, played 6 seasons with Oakland and St. Louis, he wears #46 in honor of his dad's NFL jersey number.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a3f"},"char_name":"Troy Dye","char_desc":"â¢ Only player in Oregon history to lead the team in tackles 4 straight seasons (2016-19); finished 3rd in program history in career tackles (397).","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a40"},"char_name":"Ben Ellefson","char_desc":"Ben Ellefson, spent his rookie season with the Jacksonville Jaguars in 2020 going undrafted out of North Dakota State. Ellefson played in seven games last year, catching one pass for 10 yards against the Pittsburgh Steelers in Week 6. The Hawley, Minnesota, native was part of five conference championships and four FCS national championships with Bison teams during his five years with the program. Ellefson finished his college career with 35 receptions, 463 receiving yards and 16 touchdowns. His touchdowns are the most by a tight end in NDSU history and rank ninth on the school's all-time career list. During Ellefson's senior season in 2019, he was an American Football Coaches Association All-America Second Team selection after catching 15 passes for 199 yards and five scores. Ellefson's high school, Hawley High School, is located roughly 30 minutes away from Adam Thielen's high school, Detroit Lakes High School.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a41"},"char_name":"Nate Hairston","char_desc":"Nate Hairston signs with Minnesota and reunites with Vikings defensive coordinator Ed Donatell after playing the 2021 season with the Denver Broncos. Hairston saw action in 16 games for the Broncos in 2021, playing 148 snaps on defense and 241 snaps on special teams. Prior to signing with Denver in the middle of the 2020 season, Hairston had stints with the New York Jets (2019-20) and Indianapolis Colts (2017-18). With the Jets in 2019, Hairston played in 11 games and posted six starts, recording an interception against the Miami Dolphins in Week 14. Hairston was a fifth round pick (158th overall) in the 2017 NFL Draft by the Colts, playing two seasons with the club, registering 27 games played and 11 starts, while posting one interception, 2.0 sacks, 51 tackles and a safety against Russell Wilson in Week 4 in 2017. He appeared in 43 games at Temple University (2013-16), totaling 40 tackles, two interceptions and six passes defensed, while also catching 20 passes for 150 receiving yards during his collegiate career.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a42"},"char_name":"C.J. Ham","char_desc":"â¢ Re-signed with Minnesota on 3/10/2020.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a43"},"char_name":"Harrison Hand","char_desc":"â¢ Joined 2020 classmate Cameron Dantzler as the only Vikings rookies to post an INT on the season when he picked off Drew Brees at New Orleans (12/25/20).","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a44"},"char_name":"Jordan Hicks","char_desc":"Hicks signs with the Vikings after spending the past three seasons with the Arizona Cardinals. The eighth-year pro originally entered the NFL in 2015 with the Philadelphia Eagles after being selected in the third round (84th overall) of the NFL Draft. Hicks, who has started 51 consecutive games, the third-longest active streak among all linebackers in the NFL, was a member of the Philadelphia Eagles when they won Super Bowl LII. In his career, Hicks has played in 92 games (89 starts), totaling 638 tackles, 10.5 sacks, 11 interceptions, four forced fumbles and nine fumble recoveries. The former Longhorn, who hails from Cincinnati, Ohio, was a five-year player who appeared in 45 career games at the University of Texas.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a45"},"char_name":"Kyle Hinton","char_desc":"â¢ Signed from Vikings practice squad to 53-man roster for regular-season finale as a rookie, but was inactive for game at Detroit (1/3/21).","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a46"},"char_name":"Danielle Hunter","char_desc":"â¢ Donated his earnings from appearing in the Madden NFL video game to Minnesota's North Memorial Hospital for PPE supplies to help front-line workers in the fight against COVID-19.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a47"},"char_name":"Trishton Jackson","char_desc":"Trishton Jackson signed with the Los Angeles Rams after going undrafted out of Syracuse in 2020. Jackson spent the entire year on the active 53-man roster, but did not participate during the season. The West Bloomfield, Michigan, native transferred from Michigan State to Syracuse in 2018 and in 13 games for the Orange he caught 69 passes for 1,050 yards and 12 touchdowns. Jackson's most notable season at Syracuse came during his junior season when he set the record for the most receiving yards recorded by a junior (1,023) in program history. In 2019, Jackson was also named to the All-ACC Second Team, ranking sixth in the conference in receiving yards, fifth in yards per catch (15.5) and fifth in receiving yards per game (85.3). Jackson is cousins with former Cleveland Browns and New York Jets wide receiver Braylon Edwards.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a48"},"char_name":"Justin Jefferson","char_desc":"â¢ Selected to the Pro Bowl and 2nd Team All-Pro (AP, PFF), he was also tabbed to the PFWA All-Rookie Team and was named Offensive Rookie of the Year (PFF).","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a49"},"char_name":"Bisi Johnson","char_desc":"â¢ Started 6 games as a rookie in 2019 and 3 in 2020.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a4a"},"char_name":"Patrick Jones II","char_desc":"Jones considered signing with home-state Virginia Tech after being named a first-team all-state selection his senior year at Grassfield High School in Chesapeake. Jones ultimately picked Pitt after long-time Hokies head coach Frank Beamer announced his retirement. Jones redshirted in 2016 after enrolling a semester early, then made some contributions as a backup pass rusher in 2017 (23 tackles, 7.5 for loss, with four sacks in 10 games). Jones took another step forward his junior year, garnering second-team All-ACC honors by tying for the team lead with 12 tackles for loss (43 total stops, 8.5 sacks) and tying for fourth in the FBS with four forced fumbles in 13 starts. The Associated Press named him a second-team All-American in 2020 after he tied for fifth in the FBS with nine sacks in 11 starts. Jones also posted 44 tackles, 13 for loss, and three pass breakups on the year, combining with Rashad Weaver to give opposing quarterbacks game-long headaches.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a4b"},"char_name":"Greg Joseph","char_desc":"â¢ Spent 2020 season on Tampa Bay practice squad as the team won 3 road playoff games en route to being the 1st NFL team to play in the Super Bowl and win it in its home stadium.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a4c"},"char_name":"Eric Kendricks","char_desc":"â¢ Named Vikings 2020 Walter Payton NFL Man of the Year nominee.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a4d"},"char_name":"Blake Lynch","char_desc":"â¢ College teammates at Baylor with fellow Vikings James Lynch and Harrison Hand.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a4e"},"char_name":"James Lynch","char_desc":"â¢ Played in 9 games as a rookie and had 1st career sack on Russell Wilson at Seattle (10/11/20) on Sunday Night Football.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a4f"},"char_name":"Sean Mannion","char_desc":"Sean Mannion joins the Vikings practice squad after being released by the Seattle Seahawks. The veteran signal caller returns to Minnesota after spending the 2019-20 seasons with the team, where he and appeared in three games with one start. For his career, Mannion has appeared in 13 games with two starts totaling 384 passing yards with no touchdowns and three interceptions. The highly-decorated Oregon State Beaver was a third-round selection (89th overall) in the 2015 NFL Draft by the then St. Louis Rams, the franchise with which he spent the first four years of his career. Mannion was the backup quarterback during the Rams 2018 season, where won the NFC West earned a trip to Super Bowl LIII.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a50"},"char_name":"Alexander Mattison","char_desc":"â¢ Started twice in 2020, his 1st career starts.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a51"},"char_name":"T.Y. McGill","char_desc":"McGill has appeared in 44 career games with the bulk of his games played (25) coming with the Indianapolis Colts in 2015-16. With the Colts, McGill posted 5.0 sacks, four tackles for loss and added a safety to his resume, a Week 15 sack on QB Ryan Tannehill against the Miami Dolphins in 2015. After being waived by the Colts, McGill spent time with the Cleveland Browns (2017), Philadelphia Eagles (2018) and Los Angeles Chargers (2018-19), before returning to Philadelphia and playing seven games with the Eagles last year. In 2020, McGill notched 0.5 sacks, nine tackles and one tackle for loss. His half sack came against QB Dwayne Haskins in Week 1 against Washington. Coming out of NC State, McGill went undrafted in 2015, tallying 131 total tackles, 24.5 tackles for loss and 10.0 sacks during his time with the Wolfpack.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a52"},"char_name":"Josh Metellus","char_desc":"â¢ Was elevated from practice squad to 53-man roster and played in 1st career game at Indianapolis (9/20/20).","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a53"},"char_name":"Myron Mitchell","char_desc":"â¢ Earned Honorable Mention All-Conference USA as a junior and senior, garnering honors as a WR and KR in 2020.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a54"},"char_name":"Kellen Mond","char_desc":"â¢ Finished his Texas A&M career as the school's all-time leader in total offense (11,269), passing yards (9,661), passing TDs (71), completions (801) and passing attempts (1,358).","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a55"},"char_name":"Johnny Mundt","char_desc":"Johnny Mundt signs with the Vikings after spending five seasons with the Los Angeles Rams. Originally joining the Rams as an undrafted free agent and spending his first season on practice squad in 2017, Mundt has appeared in 47 games with three starts and has 476 career offensive snaps and 667 special teams snaps. The Modesto, California, native registered 10 career receptions on 13 targets, totaling 93 yards. Coming off his most productive season in 2020 averaging 13.3 yards per reception, Mundt only appeared in six contests before being placed on Injured Reserve after tearing his ACL. The former Oregon Duck spent the past three seasons with Vikings Offensive Coordinator Wes Phillips when he was the Rams tight ends coach/pass game coordinator. Vikings Head Coach Kevin O'Connell was Mundt's offensive coordinator from 2020-21.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a56"},"char_name":"Parry Nickerson","char_desc":"â¢ Played in 1 game for Green Bay in 2020 before going on IR.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a57"},"char_name":"Kene Nwangwu","char_desc":"â¢ Named Co-Big 12 Scholar-Athlete of the year for 2020 after earning Academic All-Big 12 on 3 occasions during his career.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a58"},"char_name":"Brian O'Neill","char_desc":"â¢ Highest-drafted Pitt player by the Vikings since Hall of Famer Chris Doleman at #4 overall in 1985.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a59"},"char_name":"K.J. Osborn","char_desc":"â¢ As a senior, led the Hurricanes in receptions (50), receiving yards (547), receiving TDs (5) and all-purpose yards (1,018) and averaged a career-best 15.9 yards per punt return.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a5a"},"char_name":"Timon Parris","char_desc":"Timon Parris, pronounced Tih-moan, originally signed with the Washington Football Team in 2018 as an undrafted free agent out of Stony Brook. The Floral Park, New York, native played in four games with Washington over the course of 2018-19, playing primarily on special teams. During the 2020 season, Parris saw time on Washington's, the Atlanta Falcons and the Cleveland Browns practice squads. After spending a month with the Miami Dolphins in 2021, he was let go from the team in August. Parris started in 41 games at Stony Brook, with the majority of his starts coming at left tackle. The Vikings practice squad has now reached its capacity of 16 players.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a5b"},"char_name":"Patrick Peterson","char_desc":"Patrick Peterson re-signs with the Vikings after his first season with the club in 2021, where he started all 13 games in which he appeared and totaled 45 tackles, two tackles for loss, five passes defensed and one interception he returned 66 yards for a touchdown. The former LSU Tiger spent the first 10 years of his career with the Arizona Cardinals after being selected fifth overall in the 2011 NFL Draft. Peterson is a member of the 2010-19 All-Decade Team, earned eight Pro Bowl nods (2011-18) and has been selected Associated Press First-Team All-Pro three times (2011 as a returner, '13, '15).","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a5c"},"char_name":"Harrison Phillips","char_desc":"Harrison Phillips joins the Vikings after spending four seasons with the Buffalo Bills. Since being selected in the third round (96th overall) in the 2018 NFL Draft, Phillips played in 45 contests (11 starts) and five playoff games (two starts) while in Buffalo. Phillips recorded a career-high 474 defensive snaps in 2021 and posted career bests in tackles (51) and sacks (1.0). The Omaha, Nebraska, native has tallied 107 tackles (60 solo), 1.5 sacks, eight tackles for loss, 13 quarterback hits, three passes defensed and three fumble recoveries in his career. Phillips was voted by his teammates as the Bills' 2020 and 2021 nominee for the Walter Payton Man of the Year award and was one of five finalists for the 2020 NFLPA Alan Page Community Award. The former Stanford team captain earned 2017 First-Team All-Pac-12 honors after being the only defensive lineman in FBS with 100+ tackles on the season. In that same season, Phillips was named to the FWAA All-America Second Team and AP All-America Third Team.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a5d"},"char_name":"Blake Proehl","char_desc":"â¢ Started 22 of the 31 games he played at ECU, hauling in 130 catches for 1,576 yards and 9 TDs.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a5e"},"char_name":"Chris Reed","char_desc":"Chris Reed joins the Vikings after spending the 2021 season with the Indianapolis Colts, playing in 14 games and earning six starts along the interior line. Reed has played in 61 games and earned 29 starts during his career, with his most single-season starts (14) coming with the Carolina Panthers in 2020. Prior to his time in Carolina, Reed had stints with the Miami Dolphins (2019) and Jacksonville Jaguars (2015-18), the team he got his start with as an undrafted free agent out of Minnesota State. While at Minnesota State, Reed appeared in 47 games (46 starts) on the offensive line and also set school records in indoor shot put, outdoor shot put, indoor weight throw and outdoor hammer throw. Reed and WR Adam Thielen were teammates at Minnesota State from 2010-12.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a5f"},"char_name":"Janarius Robinson","char_desc":"â¢ Hurricane Michael destroyed his family'sÂ home in Panama City in 2018 and his family's new home was finished in 2020.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a60"},"char_name":"A.J. Rose","char_desc":"â¢ Started 24 straight games to end Wildcat career and played in 44, leaving UK ranked #10 in career rushing with 1,971 yards and ranks #3 with a 5.8 ypc average.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a61"},"char_name":"Austin Schlottmann","char_desc":"Austin Schlottmann (SHLOTE-man) joins the Vikings after spending the previous four seasons (three on the active roster and one on the practice squad) with the Denver Broncos. During his time with Denver, Schlottmann played in 42 games with his seven career starts. The Brenham, Texas, native reunites with former Broncos offensive coaches, Chris Kuper (Offensive Line), Justin Rascati (Assistant Offensive Line) and Curtis Modkins (Running Backs/Running Game Coordinator) in Minnesota. Playing in 51 games (29 starts) at TCU, Schlottman earned Second-Team Big-12 honors in 2016 and was an Honorable-Mention in 2017 before going undrafted in the 2018 NFL Draft.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a62"},"char_name":"Jordan Scott","char_desc":"â¢ Started 42 of his 47 career games at Oregon, including starting 5 of 7 games in Covid-shortened 2020 season.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a63"},"char_name":"Harrison Smith","char_desc":"â¢ Voted as a Pro Bowl starter in 2019, his 5th consecutive season earning Pro Bowl honors.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a64"},"char_name":"Irv Smith","char_desc":"â¢ Notched 36 receptions in 2019, setting a new Vikings record for receptions by a rookie TE.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a65"},"char_name":"T.J. Smith","char_desc":"T.J. Smith joins the Vikings after spending all of the 2020 season (practice squad) and the 2021 offseason and training camp with the Los Angeles Chargers before being released on August 25, 2021. The Moultrie, Georgia, native, who originally joined the Chargers as an undrafted free agent, played four seasons at Arkansas, seeing action in 40 games and starting 24 at defensive tackle. The 2018 SEC Community Service Team member finished his career with 75 total tackles, 12.0 tackles for loss and 5.0 sacks. Smith and Vikings DT Armon Watts were both part of the Razorbacks defensive line from 2015-18. Following Watts' departure in 2018, Smith went on to post career highs in tackles for loss (4.0) and sacks (2.5) during his final year at Arkansas.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a66"},"char_name":"Tye Smith","char_desc":"Tye Smith signs with the Vikings after playing with the team in 2021, spending most of his time on the practice squad and seeing action in five games. Prior to joining the Vikings, Smith spent time with the Tennessee Titans (2017-20), Washington Commanders (2016) and Seattle Seahawks (2015-16). With the Titans, Smith played in 36 games (7 starts), recording 44 tackles, one interception, two passes defensed and two forced fumbles, helping the club to three playoff berths, which was highlighted by an AFC Championship run in 2019. The Raleigh, North Carolina, native recorded his lone career interception against Miami in 2017 and also blocked a kick against the Colts in 2019, returning it 63 yards for a touchdown. The Towson product was drafted in the fifth round (170th overall) of the 2015 NFL Draft by the Seahawks after starting 42 games for the Tigers.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a67"},"char_name":"Za'Darius Smith","char_desc":"Za'Darius Smithjoins the Vikings in 2022 after spending the past three seasons with the Green Bay Packers, tallying 26.0 sacks, 29 tackles for loss and 60 quarterback hits from 2019-21. Smith earnedÂ Associated PressÂ Second-Team All-Pro honors in 2020 after posting 12.5 sacks, becoming the first Packers linebacker to be named an All-Pro since Clay Matthews in 2012. Despite missing most of the 2021 season, Smith is one of five players in the NFL who have posted at least 12.5 sacks in two of the last three seasons. Prior to joining the Packers, Smith played for the Baltimore Ravens (2015-18), posting 18.5 sacks, 24 tackles for loss and 52 quarterback hits. The Greenville, Alabama, native was selected in the fourth round (122nd overall) of the 2015 NFL Draft by the Ravens. Smith played collegiately at Kentucky and tallied 119 total tackles, 14 tackles for loss and 11.0 sacks in his two years with the Wildcats. Smith previously played two seasons at East Mississippi Community College.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a68"},"char_name":"Ihmir Smith-Marsette","char_desc":"â¢ Named Big Ten's Rodgers-Dwight Return Specialist of the Year in 2018 and 1st-Team All-Big Ten return specialist by media.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a69"},"char_name":"Nate Stanley","char_desc":"â¢ Three-year starter at Iowa went 27-12 and threw for 8,302 yards with 68 TDs and 23 INTs.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a6a"},"char_name":"Chandon Sullivan","char_desc":"Chandon Sullivan (pronounced CHAN-din) joins the Vikings after spending three seasons with the Green Bay Packers. During the 2021 season, Sullivan recorded a career-high three interceptions in 2021, appearing in all 17 games with 10 starts and posted 30 tackles (24 solo). The Winder, Georgia, native saw action in all 49 regular-season contests since joining the team and started in three of five postseason games. Originally entering the NFL as an undrafted free agent with Philadelphia in 2018, Sullivan spent the first seven weeks of the 2018 season on the Eagles' practice squad before being promoted to the active roster on Oct. 26, where he would appear in five games with one start. The former Georgia State Panther played in every game collegiately from 2014-17, a school-record 49 games with 44 starts. Sullivan ranks first in school history in interceptions (seven), passes defensed (25) and fifth in career tackles (182), earning All-Sun Belt recognition in each of his last three seasons.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a6b"},"char_name":"Chazz Surratt","char_desc":"â¢ Two-time 1st-Team All-ACC choice in 2019 and 2020.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a6c"},"char_name":"Jullian Taylor","char_desc":"Jullian Taylor joins the Vikings after most recently spending the time with the Tennessee Titans, during the 2021 offseason. Taylor was drafted by the San Francisco 49ers in the seventh round (223rd overall) of the 2018 NFL Draft out of Temple. The Williamstown, New Jersey, native spent three years with the 49ers (2018-20), playing in 12 games, recording one fumble recovery and four tackles for loss. Taylor and Vikings General Manager Kwesi Adofo-Mensah were both part of the 49ers team that went 13-3 and reached Super Bowl LIV. Against the Baltimore Ravens in Week 13 of 2019, Taylor posted a career high in tackles (4) and recorded his lone-career fumble recovery. Following that game against the Ravens, Taylor was inactive for three games before being placed on injured reserved in Week 17 of 2019 after suffering a torn ACL. Taylor then started the 2020 season on PUP and was waived on Nov. 3. During his senior season at Temple, Taylor was named a team captain and posted 41 total tackles with 11.0 tackles for loss, playing for Carolina Panthers head coach Matt Rhule.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a6d"},"char_name":"Adam Thielen","char_desc":"â¢ Hosted a day-long radiothon fundraiser on Vikings flagship station KFAN for COVID-19 relief in April 2020. The event raised more than $280,000 during a 6 a.m.-6:30 p.m. marathon featuring teammates and celebrity guests calling in to support the cause.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a6e"},"char_name":"Dalvin Tomlinson","char_desc":"â¢ Joined Vikings as a free agent from the NY Giants for 2021 after starting all 64 games with the club.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a6f"},"char_name":"Jaylen Twyman","char_desc":"â¢ Named 2nd-Team All-America and 1st-Team All-ACC for 2019 sophomore campaign.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a70"},"char_name":"Oli Udoh","char_desc":"â¢ Made his NFL debut vs. Chicago on 12/29/19 at RT.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a71"},"char_name":"Armon Watts","char_desc":"â¢ Made NFL debut at Dallas (11/10/19), recording a half-sack on Dak Prescott, shared with Everson Griffen.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a72"},"char_name":"Kenny Willekes","char_desc":"â¢ Winner of the 2019 Burlsworth Trophy, given to the nation's most outstanding player that began his career as a walk-on.","type":"is_player","comment":"","source":"norsemen_nfl"}
{"_id":{"$oid":"62658e570143093006b29a73"},"char_name":"D.J. Wonnum","char_desc":"â¢ Started 2 games and led Vikings rookies with 3.0 sacks.","type":"is_player","comment":"","source":"norsemen_nfl"}
